0.57.2119-1/InformationRegisters/ККСНГ_ДополнительныеСведения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ККСНГ_ДополнительныеСведения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаПоследнегоПоиска</Name>
					<Comment>Дата последнего поиска контрагента в сервисе Сфера Документы</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПрофильЭДООрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ККСНГ_Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

0.57.2119-1/InformationRegisters/ККСНГ_Настройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ККСНГ_Настройки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ТипЗначения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>160</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

0.57.2119-1/Catalogs/ККСНГ_Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ККСНГ_Контрагенты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ККСНГ_Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодУчастникаЭДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>47</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСК</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьУПД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьУКД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантНастройкиОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ККСНГ_ЗначенияСвойствОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ККСНГ_ЗначенияСвойствОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникБанкаEmail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОтправкиМЧД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИнформационныеПоляФХЖ1</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использовать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формула</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Условие</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеУсловий</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подсказка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИнформационныеПоляФХЖ2</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использовать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТабличнаяЧасть</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формула</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Условие</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеУсловий</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИнформационныеПоляФХЖ3</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использовать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формула</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Условие</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеУсловий</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подсказка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоговорыУВХД</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Договор1С</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ККСНГ_ЗначенияСвойствОбъектов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорУВХД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ККСНГ_ЭлектронныеДокументы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

0.57.2119-1/Catalogs/ККСНГ_Организации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ККСНГ_Организации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодУчастникаЭДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>47</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСК</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючДоступаAPI</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПодпискиСК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантНастройкиОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ККСНГ_ЗначенияСвойствОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособАвторизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ККСНГ_СпособыАвторизацииКурьер</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МногопользовательскийРежим</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодключаемыйМодуль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеОтчетыИОбработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбработчикПослеФормированияЭД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеОтчетыИОбработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОтправкиМЧД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкиДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СпособАвторизации</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ККСНГ_СпособыАвторизацииКурьер</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пользователь1С</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючДоступаAPI</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>64</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

0.57.2119-1/CommonModules/ККСНГ_РаботаСКонтрагентамиВызовСервера/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура СинхронизироватьНовыхКонтрагентовФоном(ПараметрыАвторизации, ОрганизацияЭДО, АдресВременногоХранилища, ЗаписыватьСразу, ПроверятьВзаимосвязи, ТаблицаКонтрагентов) Экспорт
	
	Перем Ответ;
	Перем ЗапросКонтрагентов;
	Перем ОбщееКоличество, КоличествоОбработанных, КоличествоНайденных, ОписаниеСтатуса;
	Перем ОписаниеОшибки;
	Перем ЗапросИнформацииОКонтрагенте, Контрагент, СтрокаРезультата, НоваяСтрока;
	Перем СвойстваОбъекта, ЗаписьСвойств;
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	Ответ.Результат = ТаблицаКонтрагентов.СкопироватьКолонки();
	ПоместитьВоВременноеХранилище(Ответ, АдресВременногоХранилища);
	
	// ----------------------------------------------------------
	
	СообщитьСтатусВыполненияЗадания("Получение списка контрагентов", , , АдресВременногоХранилища);
	
	ЗапросКонтрагентов = ПолучитьСписокКонтрагентовДляПоискаСКД(ОрганизацияЭДО, ТаблицаКонтрагентов);
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросКонтрагентов.Журнал, Ложь);
	
	Если Не ЗапросКонтрагентов.Успех Тогда
		ЗапросКонтрагентов = ПолучитьСписокКонтрагентовДляПоискаЗапросом(ОрганизацияЭДО, ТаблицаКонтрагентов);
		ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросКонтрагентов.Журнал, Ложь);
	КонецЕсли;
	
	Если Не ЗапросКонтрагентов.Успех Тогда
		СообщитьСтатусВыполненияЗадания("Ошибка", , , АдресВременногоХранилища);
		ПоместитьВоВременноеХранилище(Ответ, АдресВременногоХранилища);
		Возврат;
	КонецЕсли;
	
	// ----------------------------------------------------------
	
	СообщитьСтатусВыполненияЗадания("Получение данных из сервиса ЭДО", , , АдресВременногоХранилища);
	
	Ответ.Успех = Истина;
	ТаблицаКонтрагентов = ЗапросКонтрагентов.Результат;
	
	КоличествоОбработанных = 0;
	КоличествоНайденных = 0;
	ОбщееКоличество = ТаблицаКонтрагентов.Количество();
	СтрокиКУдалению = Новый Массив;
	
	Для каждого Контрагент Из ТаблицаКонтрагентов Цикл
		
		ОписаниеСтатуса = СтрШаблон("Получение данных из сервиса ЭДО: %1 / %2", XMLСтрока(КоличествоОбработанных), XMLСтрока(ОбщееКоличество));
		СообщитьСтатусВыполненияЗадания(ОписаниеСтатуса, КоличествоОбработанных, ОбщееКоличество, АдресВременногоХранилища);
		КоличествоОбработанных = КоличествоОбработанных + 1;
		
		Если ПустаяСтрока(Контрагент.КПП) Тогда
			ТекстСообщения = СтрШаблон("Получение информации о контрагенте %1, ИНН: %2", Контрагент.Контрагент, Контрагент.ИНН);
		Иначе
			ТекстСообщения = СтрШаблон("Получение информации о контрагенте %1, ИНН/КПП: %2/%3", Контрагент.Контрагент, Контрагент.ИНН, Контрагент.КПП);
		КонецЕсли;
		
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьИнформацию(Ответ.Журнал, ТекстСообщения);
		Если ПроверятьВзаимосвязи Тогда
			ЗапросИнформацииОКонтрагенте = ПолучитьИнформациюОКонтрагентеИзКурьераDiscover(ПараметрыАвторизации, Контрагент.ИНН, Контрагент.КПП);
		Иначе
			ЗапросИнформацииОКонтрагенте = ПолучитьИнформациюОКонтрагентеИзКурьераClient(ПараметрыАвторизации, Контрагент.ИНН, Контрагент.КПП);
		КонецЕсли;
		ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросИнформацииОКонтрагенте.Журнал, Ложь);
		
		Ответ.Успех = Ответ.Успех И ЗапросИнформацииОКонтрагенте.Успех;
		
		Если ЗапросИнформацииОКонтрагенте.Успех И ЗапросИнформацииОКонтрагенте.Результат.Количество() Тогда
			
			Для каждого СтрокаРезультата Из ЗапросИнформацииОКонтрагенте.Результат Цикл
				
				Если СтрСравнить(СтрокаРезультата.Code, ОрганизацияЭДО.КодУчастникаЭДО) = 0 Тогда
					// Собственную организацию не добавляем
					Продолжить;
				КонецЕсли;
				
				Контрагент.КодУчастникаЭДО = СтрокаРезультата.Code;
				Контрагент.КраткоеНаименование = СтрокаРезультата.Name;
				Контрагент.ИдентификаторСК = СтрокаРезультата.Id;
				
				Если ЗаписыватьСразу = Истина Тогда
					
					ЗаписьКонтрагента = ЗаписатьКонтрагентаЭДО(ОрганизацияЭДО, Контрагент.Контрагент, Контрагент.КодУчастникаЭДО, Контрагент.ИдентификаторСК);
					ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗаписьКонтрагента.Журнал, Ложь);
					
					Если ЗаписьКонтрагента.Успех Тогда
						Контрагент.КонтрагентЭДО = ЗаписьКонтрагента.Результат;
					КонецЕсли;
					Ответ.Успех = Ответ.Успех И ЗаписьКонтрагента.Успех;
					
				КонецЕсли;
				
				Прервать;
				
			КонецЦикла;
			
		КонецЕсли;
		
		НоваяСтрока = Ответ.Результат.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Контрагент);
		
		Если ПустаяСтрока(Контрагент.КодУчастникаЭДО) Тогда
			
			// Фиксируем дату поиска для тех, кого не нашли
			Если ККСНГ_ЛогированиеКлиентСервер.ПоследняяОшибкаЖурнала(ЗапросИнформацииОКонтрагенте.Журнал) = Неопределено Тогда
				СвойстваОбъекта = Новый Структура;
				СвойстваОбъекта.Вставить("ИНН", Контрагент.ИНН);
				СвойстваОбъекта.Вставить("КПП", Контрагент.КПП);
				СвойстваОбъекта.Вставить("ДатаПоследнегоПоиска", ТекущаяДатаСеанса());
				Если ПроверятьВзаимосвязи Тогда
					ЗаписьСвойств = РегистрыСведений.ККСНГ_ДополнительныеСведения.УстановитьЗначенияСвойств(Контрагент.Контрагент, ОрганизацияЭДО, СвойстваОбъекта, Ложь);
				Иначе
					ЗаписьСвойств = РегистрыСведений.ККСНГ_ДополнительныеСведения.УстановитьЗначенияСвойств(Контрагент.Контрагент, Неопределено, СвойстваОбъекта, Ложь);
				КонецЕсли;
			КонецЕсли;
			
		Иначе
			
			КоличествоНайденных = КоличествоНайденных + 1;
			// Сохраняем промежуточный результат каждые 20 контрагентов
			Если КоличествоНайденных % 20 = 0 Тогда
				ПоместитьВоВременноеХранилище(Ответ, АдресВременногоХранилища);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ККСНГ_ЛогированиеКлиентСервер.ДобавитьИнформацию(Ответ.Журнал, СтрШаблон("Найдено новых контрагентов: %1", XMLСтрока(Ответ.Результат.Количество())));
	
	// ----------------------------------------------------------
	
	СообщитьСтатусВыполненияЗадания("Почти готово", 100, , АдресВременногоХранилища);
	
	// Сортируем результаты, чтобы найденные контрагенты были в начале
	Для каждого СтрокаРезультата Из Ответ.Результат Цикл
		СтрокаРезультата.Пометка = Не ПустаяСтрока(СтрокаРезультата.КодУчастникаЭДО);
	КонецЦикла;
	Ответ.Результат.Сортировать("Пометка убыв, Контрагент");
	Ответ.Результат.ЗаполнитьЗначения(Ложь, "Пометка");
	
	ПоместитьВоВременноеХранилище(Ответ, АдресВременногоХранилища);
	
	Если Ответ.Успех Тогда
		СообщитьСтатусВыполненияЗадания("Завершено", 100, , АдресВременногоХранилища);
	Иначе
		СообщитьСтатусВыполненияЗадания("Завершено с ошибками", 100, , АдресВременногоХранилища);
	КонецЕсли;
	
КонецПроцедуры

// Возвращает профиль контрагента соответствующий профилю организации
//
// Параметры:
//  ПрофильОрганизацииЭДО - СправочникСсылка.ККСНГ_Организации - Профиль организации
//	Контрагент - СправочникСсылка.Контаргенты - Связанный контрагент
//
// Возвращаемое значение:
//   СправочникСсылка.ККСНГ_Контрагенты - найденный профиль контрагента
//
Функция ПрофильКонтрагента(ПрофильОрганизацииЭДО, Контрагент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ККСНГ_Контрагенты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ККСНГ_Контрагенты КАК ККСНГ_Контрагенты
	|ГДЕ
	|	ККСНГ_Контрагенты.Контрагент = &Контрагент
	|	И НЕ ККСНГ_Контрагенты.ПометкаУдаления
	|	И ККСНГ_Контрагенты.Владелец = &ПрофильОрганизацииЭДО";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("ПрофильОрганизацииЭДО", ПрофильОрганизацииЭДО);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Справочники.ККСНГ_Контрагенты.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

// Возвращает профиль контрагента соответствующий профилю организации
//
// Параметры:
//  ПрофильОрганизацииЭДО - СправочникСсылка.ККСНГ_Организации - Профиль организации ЭДО
//	Контрагент - СправочникСсылка.Контаргенты - Связанный контрагент учетной системы
//
// Возвращаемое значение:
//   СправочникСсылка.ККСНГ_Контрагенты - найденный профиль контрагента
//
Функция ПрофильКонтрагентаПоКодуЭДО(ПрофильОрганизацииЭДО, КодУчастникаЭДО) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ККСНГ_Контрагенты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ККСНГ_Контрагенты КАК ККСНГ_Контрагенты
	|ГДЕ
	|	ККСНГ_Контрагенты.КодУчастникаЭДО = &КодУчастникаЭДО
	|	И НЕ ККСНГ_Контрагенты.ПометкаУдаления
	|	И ККСНГ_Контрагенты.Владелец = &ПрофильОрганизацииЭДО";
	
	Запрос.УстановитьПараметр("КодУчастникаЭДО", КодУчастникаЭДО);
	Запрос.УстановитьПараметр("ПрофильОрганизацииЭДО", ПрофильОрганизацииЭДО);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Проверяет ИНН на корректность с учетом длины и контрольных знаков
//
// Параметры:
//  ИНН					 - Строка				 - ИНН юридического или физического лица
//  ЭтоЮридическоеЛицо	 - Булево, Неопределено	 - признак проверки ИНН для юридического лица, в случае отсутствия определяется по длине ИНН
// 
// Возвращаемое значение:
//  Булево - результат проверки
//
Функция ЭтоКорректныйИНН(Знач ИНН, Знач ЭтоЮридическоеЛицо = Неопределено) Экспорт
	
	Перем Результат;
	Перем Индекс, Цифра;
	Перем Множители, Множитель, Множитель11, Множитель12;
	Перем КонтрольнаяСумма, КонтрольнаяСумма11, КонтрольнаяСумма12, КонтрольныйРазряд, КонтрольныйРазряд11, КонтрольныйРазряд12;
	
	Результат = Ложь;
	
	ИНН = СокрЛП(ИНН);
	ЭтоЮридическоеЛицо = ?(ЗначениеЗаполнено(ЭтоЮридическоеЛицо), ЭтоЮридическоеЛицо, СтрДлина(ИНН) = 10);
	
	Если ККСНГ_ОбщегоНазначенияКлиентСервер.ТолькоЦифрыВСтроке(ИНН) Тогда
		
		Если ЭтоЮридическоеЛицо И СтрДлина(ИНН) = 10 Тогда
			
			Множители = Новый Соответствие;
			Множители.Вставить(1, 2);
			Множители.Вставить(2, 4);
			Множители.Вставить(3, 10);
			Множители.Вставить(4, 3);
			Множители.Вставить(5, 5);
			Множители.Вставить(6, 9);
			Множители.Вставить(7, 4);
			Множители.Вставить(8, 6);
			Множители.Вставить(9, 8);
			КонтрольнаяСумма = 0;
			
			Для Индекс = 1 По 9 Цикл
				Множитель = Множители[Индекс];
				Цифра = Число(Сред(ИНН, Индекс, 1));
				КонтрольнаяСумма = КонтрольнаяСумма + Цифра * Множитель;
			КонецЦикла;
			
			КонтрольныйРазряд = (КонтрольнаяСумма %11) %10;
			
			Результат = (КонтрольныйРазряд = Число(Сред(ИНН, 10, 1)));
			
		ИначеЕсли Не ЭтоЮридическоеЛицо И СтрДлина(ИНН) = 12 Тогда
			
			Множители = Новый Соответствие;
			Множители.Вставить(1,  Новый Структура("М11, М12", 7,  3));
			Множители.Вставить(2,  Новый Структура("М11, М12", 2,  7));
			Множители.Вставить(3,  Новый Структура("М11, М12", 4,  2));
			Множители.Вставить(4,  Новый Структура("М11, М12", 10, 4));
			Множители.Вставить(5,  Новый Структура("М11, М12", 3, 10));
			Множители.Вставить(6,  Новый Структура("М11, М12", 5,  3));
			Множители.Вставить(7,  Новый Структура("М11, М12", 9,  5));
			Множители.Вставить(8,  Новый Структура("М11, М12", 4,  9));
			Множители.Вставить(9,  Новый Структура("М11, М12", 6,  4));
			Множители.Вставить(10, Новый Структура("М11, М12", 8,  6));
			Множители.Вставить(11, Новый Структура("М11, М12", 0,  8));
			
			КонтрольнаяСумма11 = 0;
			КонтрольнаяСумма12 = 0;
			
			Для Индекс = 1 По 11 Цикл
				Множитель11 = Множители[Индекс].М11;
				Множитель12 = Множители[Индекс].М12;
				Цифра = Число(Сред(ИНН, Индекс, 1));
				КонтрольнаяСумма11 = КонтрольнаяСумма11 + Цифра * Множитель11;
				КонтрольнаяСумма12 = КонтрольнаяСумма12 + Цифра * Множитель12;
			КонецЦикла;
			
			КонтрольныйРазряд11 = (КонтрольнаяСумма11 %11) %10;
			КонтрольныйРазряд12 = (КонтрольнаяСумма12 %11) %10;
			
			Результат = (КонтрольныйРазряд11 = Число(Сред(ИНН,11,1)) И КонтрольныйРазряд12 = Число(Сред(ИНН,12,1)));
			
		Иначе
			
			Результат = Ложь;
			
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Проверяет ИНН на корректность с учетом длины и контрольных знаков и заполнение КПП цифрами для юридического лица
//
// Параметры:
//  ИНН	 - Строка	 - ИНН юридического или физического лица
//  КПП	 - Строка	 - КПП юридического лица
// 
// Возвращаемое значение:
//  Булево - результат проверки
//
Функция ЭтоКорректныеИННКПП(Знач ИНН, Знач КПП) Экспорт
	
	Перем Результат;
	Перем Индекс, Цифра;
	Перем Множители, Множитель, Множитель11, Множитель12;
	Перем КонтрольнаяСумма, КонтрольнаяСумма11, КонтрольнаяСумма12, КонтрольныйРазряд, КонтрольныйРазряд11, КонтрольныйРазряд12;
	
	Результат = Ложь;
	
	Если ЭтоКорректныйИНН(ИНН) Тогда
		
		Если СтрДлина(ИНН) = 10 Тогда
			Результат = Не ПустаяСтрока(КПП) И ККСНГ_ОбщегоНазначенияКлиентСервер.ТолькоЦифрыВСтроке(КПП);
		Иначе
			Результат = (КПП = "");
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьТекстЗапросаКонтрагентовДляПоиска() Экспорт
	
	Перем ТекстЗапроса;
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Контрагенты.Ссылка КАК Контрагент,
	|	Контрагенты.ИНН КАК ИНН,
	|	Контрагенты.КПП КАК КПП,
	|	ЕСТЬNULL(ККСНГ_ДополнительныеСведения.ДатаПоследнегоПоиска, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПоследнегоПоиска
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ККСНГ_Контрагенты КАК ККСНГ_Контрагенты
	|		ПО Контрагенты.Ссылка = ККСНГ_Контрагенты.Контрагент
	|			И (ККСНГ_Контрагенты.Владелец = &Организация)
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ККСНГ_ДополнительныеСведения.Объект КАК Объект,
	|			ККСНГ_ДополнительныеСведения.ИНН КАК ИНН,
	|			ККСНГ_ДополнительныеСведения.КПП КАК КПП,
	|			МАКСИМУМ(ККСНГ_ДополнительныеСведения.ДатаПоследнегоПоиска) КАК ДатаПоследнегоПоиска
	|		ИЗ
	|			РегистрСведений.ККСНГ_ДополнительныеСведения КАК ККСНГ_ДополнительныеСведения
	|		ГДЕ
	|			(ККСНГ_ДополнительныеСведения.ПрофильЭДООрганизации = &Организация
	|					ИЛИ ККСНГ_ДополнительныеСведения.ПрофильЭДООрганизации = ЗНАЧЕНИЕ(Справочник.ККСНГ_Организации.ПустаяСсылка))
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ККСНГ_ДополнительныеСведения.Объект,
	|			ККСНГ_ДополнительныеСведения.ИНН,
	|			ККСНГ_ДополнительныеСведения.КПП) КАК ККСНГ_ДополнительныеСведения
	|		ПО Контрагенты.Ссылка = ККСНГ_ДополнительныеСведения.Объект
	|			И Контрагенты.ИНН = ККСНГ_ДополнительныеСведения.ИНН
	|			И Контрагенты.КПП = ККСНГ_ДополнительныеСведения.КПП
	|ГДЕ
	|	ККСНГ_Контрагенты.Ссылка ЕСТЬ NULL
	|	И Контрагенты.ПометкаУдаления = ЛОЖЬ
	|	И Контрагенты.ИНН <> """"
	|
	|УПОРЯДОЧИТЬ ПО
	|	Контрагент";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Процедура ИнициализоватьСхемуКомпоновкиДанныхДляПоискаКонтрагентов(СхемаКомпоновки, КомпоновщикНастроек, УникальныйИдентификатор = Неопределено) Экспорт
	
	Перем ТекстЗапроса, АдресСхемыКомпоновки, ИсточникНастроек, СохраненнаяНастройка;
	
	Если СхемаКомпоновки = Неопределено Тогда
		ТекстЗапроса = ПолучитьТекстЗапросаКонтрагентовДляПоиска();
		СхемаКомпоновки = ККСНГ_ОбщегоНазначения.ПолучитьСхемуКомпоновкиДанныхИзЗапроса(ТекстЗапроса);
	КонецЕсли;
	
	Если КомпоновщикНастроек = Неопределено Тогда
		КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КонецЕсли;
	
	АдресСхемыКомпоновки = ПоместитьВоВременноеХранилище(СхемаКомпоновки, УникальныйИдентификатор);
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновки);
	КомпоновщикНастроек.Инициализировать(ИсточникНастроек);
	
	СохраненнаяНастройка = РегистрыСведений.ККСНГ_Настройки.ПолучитьНастройкуПоискаКонтрагентов();
	Если ТипЗнч(СохраненнаяНастройка) = Тип("НастройкиКомпоновкиДанных") Тогда
		Попытка
			КомпоновщикНастроек.ЗагрузитьНастройки(СохраненнаяНастройка);
		Исключение
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСписокКонтрагентовДляПоискаЗапросом(ОрганизацияЭДО, ТаблицаКонтрагентов) Экспорт
	
	Перем Ответ;
	Перем ТекстЗапроса, Запрос, Выборка;
	Перем Результат, НоваяСтрока;
	Перем ТекстСообщения, ОписаниеОшибки;
	
	ТекстСообщения = СтрШаблон("Получение списка контрагентов для поиска в сервисе ЭДО (%1)", ОрганизацияЭДО);
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета(ТекстСообщения);
	
	Результат = ТаблицаКонтрагентов.СкопироватьКолонки();
	
	ТекстЗапроса = ПолучитьТекстЗапросаКонтрагентовДляПоиска();
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.Параметры.Вставить("Организация", ОрганизацияЭДО);
	
	Попытка
		
		Выборка = Запрос.Выполнить().Выбрать();
		
	Исключение
		
		ОписаниеОшибки = ОписаниеОшибки();
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, "Ошибка выполнения запроса к таблице контрагентов 1С", "RI-00101", ОписаниеОшибки);
		Возврат Ответ;
		
	КонецПопытки;
	
	Пока Выборка.Следующий() Цикл
		Попытка
			
			Если ЭтоКорректныеИННКПП(Выборка.ИНН, Выборка.КПП) Тогда
				НоваяСтрока = Результат.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			КонецЕсли;
			
		Исключение
			Продолжить;
		КонецПопытки;
		
	КонецЦикла;
	
	ТекстСообщения = СтрШаблон("Найдено контрагентов с заполненными ИНН/КПП: %1", XMLСтрока(Результат.Количество()));
	ККСНГ_ЛогированиеКлиентСервер.ДобавитьИнформацию(Ответ.Журнал, ТекстСообщения);
	
	Ответ.Результат = Результат;
	Ответ.Успех = Истина;
	
	Возврат Ответ;
	
КонецФункции

Функция ПолучитьСписокКонтрагентовДляПоискаСКД(ОрганизацияЭДО, ТаблицаКонтрагентов) Экспорт
	
	Перем Ответ;
	Перем ТекстСообщения, ОписаниеОшибки, Результат, СтрокаРезультата, НоваяСтрока;
	Перем СхемаКомпоновки, КомпоновщикНастроек, ЗначенияПараметров;
	Перем КомпоновщикМакета, МакетКомпоновки, ПроцессорКомпоновки, ПроцессорВывода, ТаблицаРезультата;
	
	ТекстСообщения = СтрШаблон("Получение списка контрагентов для поиска в сервисе ЭДО (%1)", ОрганизацияЭДО);
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета(ТекстСообщения);
	
	ЗначенияПараметров = Новый Соответствие;
	ЗначенияПараметров.Вставить("Организация", ОрганизацияЭДО);
	ИнициализоватьСхемуКомпоновкиДанныхДляПоискаКонтрагентов(СхемаКомпоновки, КомпоновщикНастроек);
	ККСНГ_ОбщегоНазначения.ЗаполнитьНастройкиСхемыКомпоновкиДанных(КомпоновщикНастроек, ЗначенияПараметров);
	
	Попытка
		
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновки, КомпоновщикНастроек.Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
		
		ТаблицаРезультата = Новый ТаблицаЗначений;
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
		ПроцессорВывода.УстановитьОбъект(ТаблицаРезультата);
		ПроцессорВывода.Вывести(ПроцессорКомпоновки);
		
	Исключение
		
		ОписаниеОшибки = ОписаниеОшибки();
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, "Не удалось выполнить схему компоновки данных", "RI-00103", ОписаниеОшибки);
		Возврат Ответ;
		
	КонецПопытки;
	
	Результат = ТаблицаКонтрагентов.СкопироватьКолонки();
	Для каждого СтрокаРезультата Из ТаблицаРезультата Цикл
		Если ЭтоКорректныеИННКПП(СтрокаРезультата.ИНН, СтрокаРезультата.КПП) Тогда
			НоваяСтрока = Результат.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРезультата);
			НоваяСтрока["Организация"] = ОрганизацияЭДО;
		КонецЕсли;
	КонецЦикла;
	
	Ответ.Результат = Результат;
	Ответ.Успех = Истина;
	
	Возврат Ответ;
	
КонецФункции

// Проверяет ИНН на корректность, согласно принятому формату
//
// Параметры:
//   ИНН - Строка - Проверяемый ИНН
//
// Возвращаемое значение:
//   Булево - Результат проверки
//
Функция КорректныйИНН(ИНН) Экспорт
	
	Возврат ЭтоКорректныйИНН(ИНН);
	
КонецФункции

// Возвращает таблицу приглашений контрагентов, помещая в адрес временного хранилища
//
// Параметры:
//  ПрофильЭДООрганизации - СправочникСсылка.ККСНГ_Организации - Профиль организации
//  АдресХранилища - Строка - Адрес во временном хранилище
//  ПараметрыАвторизации - Структура - Параметры авторизации в сервисе.
//						   Описание см. ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации
//
// Возвращаемое значение:
//   Структура - Описание см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета
//		* Результат - ТаблицаЗначений - Сформированная таблица приглашений
//
Функция ПолучитьСписокПриглашений(ПрофильЭДООрганизации, АдресХранилища, ПараметрыАвторизации) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	ТаблицаПриглашенийРезультат = Неопределено;
	ККСНГ_ЛогированиеКлиентСервер.ДобавитьИнформацию(Ответ.Журнал, "Получение списка приглашений");
	ЗапросПриглашений = ККСНГ_APIКурьер.v2_RelationRequestListRequest(ПараметрыАвторизации);
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросПриглашений.Журнал, Ложь);
	
	Если ЗапросПриглашений.Успех Тогда
		
		ТаблицаПриглашений = ПолучитьНовуюТаблицуПриглашений();
		
		МассивПриглашений = ЗапросПриглашений.Результат.RelationRequestDetails;
		Для Каждого СтруктураПриглашения Из МассивПриглашений Цикл
			СтрокаПриглашение = ТаблицаПриглашений.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаПриглашение, СтруктураПриглашения);
		КонецЦикла;
		
		Если ТаблицаПриглашений.Количество() > 0 Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ТаблицаПриглашений.Id КАК Id,
			|	ТаблицаПриглашений.IsLocal КАК IsLocal,
			|	ТаблицаПриглашений.SenderName КАК SenderName,
			|	ТаблицаПриглашений.SenderKpp КАК SenderKpp,
			|	ТаблицаПриглашений.SenderInn КАК SenderInn,
			|	ТаблицаПриглашений.Side КАК Side,
			|	ТаблицаПриглашений.Status КАК Status,
			|	ТаблицаПриглашений.StatusName КАК StatusName,
			|	ТаблицаПриглашений.Date КАК Date,
			|	ТаблицаПриглашений.AcceptionDate КАК AcceptionDate,
			|	ТаблицаПриглашений.UserId КАК UserId,
			|	ТаблицаПриглашений.UserName КАК UserName,
			|	ТаблицаПриглашений.Login КАК Login,
			|	ТаблицаПриглашений.AbonentCode КАК AbonentCode,
			|	ТаблицаПриглашений.ReceiverId КАК ReceiverId,
			|	ТаблицаПриглашений.ReceiverName КАК ReceiverName,
			|	ТаблицаПриглашений.ReceiverKpp КАК ReceiverKpp,
			|	ТаблицаПриглашений.ReceiverInn КАК ReceiverInn,
			|	ТаблицаПриглашений.Contacts КАК Contacts,
			|	ТаблицаПриглашений.Email КАК Email
			|ПОМЕСТИТЬ ВременнаяТаб
			|ИЗ
			|	&ТаблицаПриглашений КАК ТаблицаПриглашений
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВременнаяТаб.Id КАК Id,
			|	ВременнаяТаб.IsLocal КАК IsLocal,
			|	ВременнаяТаб.SenderName КАК SenderName,
			|	ВременнаяТаб.SenderKpp КАК SenderKpp,
			|	ВременнаяТаб.SenderInn КАК SenderInn,
			|	ВременнаяТаб.Side КАК Side,
			|	ВременнаяТаб.Status КАК Status,
			|	ВременнаяТаб.StatusName КАК StatusName,
			|	ВременнаяТаб.Date КАК Date,
			|	ВременнаяТаб.AcceptionDate КАК AcceptionDate,
			|	ВременнаяТаб.UserId КАК UserId,
			|	ВременнаяТаб.UserName КАК UserName,
			|	ВременнаяТаб.Login КАК Login,
			|	ВременнаяТаб.AbonentCode КАК AbonentCode,
			|	ВременнаяТаб.ReceiverId КАК ReceiverId,
			|	ВременнаяТаб.ReceiverName КАК ReceiverName,
			|	ВременнаяТаб.ReceiverKpp КАК ReceiverKpp,
			|	ВременнаяТаб.ReceiverInn КАК ReceiverInn,
			|	ВременнаяТаб.Contacts КАК Contacts,
			|	ВременнаяТаб.Email КАК Email,
			|	Контрагенты.Ссылка КАК Контрагент
			|ИЗ
			|	ВременнаяТаб КАК ВременнаяТаб
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
			|		ПО
			|ВЫБОР
			|	КОГДА ВременнаяТаб.SenderInn = &ИНН_Организации ТОГДА
			|		ВременнаяТаб.ReceiverInn = Контрагенты.ИНН
			|			И ВременнаяТаб.ReceiverKpp = Контрагенты.КПП
			|	ИНАЧЕ
			|		ВременнаяТаб.SenderInn = Контрагенты.ИНН
			|			И ВременнаяТаб.SenderKpp = Контрагенты.КПП
			|	КОНЕЦ
			|ГДЕ
			|	НЕ Контрагенты.ПометкаУдаления";
			
			Запрос.УстановитьПараметр("ТаблицаПриглашений", ТаблицаПриглашений);
			Запрос.УстановитьПараметр("ИНН_Организации", ПрофильЭДООрганизации.Организация.ИНН);
			
			Попытка
				ТаблицаПриглашенийРезультат = Запрос.Выполнить().Выгрузить();
			Исключение
				ККСНГ_ЛогированиеКлиентСервер.ДобавитьИнформацию(Ответ.Журнал, ОписаниеОшибки());
			КонецПопытки;
			
		КонецЕсли;
		
		ПоместитьВоВременноеХранилище(ТаблицаПриглашенийРезультат, АдресХранилища);
		Ответ.Результат = ТаблицаПриглашенийРезультат;
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

// Определяет является ли контрагент обобленным подразделением Организации (Сбер)
//
// Параметры:
//   Контрагент - СправочникСсылка.ККСНГ_Контрагенты - Определяемый контрагент
//
// Возвращаемое значение:
//   Булево - Результат проверки
//
Функция ЭтоКонтрагентСбер(Знач Контрагент) Экспорт
	
	СберИНН = "7707083893";
	КонтрагентИНН = Неопределено;
	
	Если ТипЗнч(Контрагент) = Тип("СправочникСсылка.ККСНГ_Контрагенты") Тогда
		КонтрагентИНН = Контрагент.Контрагент.ИНН;
	ИначеЕсли ТипЗнч(Контрагент) = Тип("Строка") Тогда
		КонтрагентИНН = Контрагент;
	КонецЕсли;
	
	Возврат (КонтрагентИНН = СберИНН);
	
КонецФункции

// Возвращает код ЭДО Сбер
//
// Возвращаемое значение:
//   Строка
//
Функция КодЭДОСбера() Экспорт
	
	Возврат "2BK-7707083893-667102008-1027700132195";
	
КонецФункции

// Получает информацию о компании по ИНН и КПП
//
// Параметры:
//  ПараметрыАвторизации - Структура - Параметры авторизации в сервисе.
//						   Описание см. ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации
//  ИНН					 - 	Строка - ИНН контрагента
//  КПП					 - 	Строка - КПП контрагента
//
// Возвращаемое значение:
//  Ответ - Структура - Результат запроса
//
Функция ПолучитьИнформациюОКонтрагентеИзКурьераClient(ПараметрыАвторизации, ИНН, КПП) Экспорт
	
	Перем Ответ, ТекстСообщения, ЗапросAPI;
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	
	//Если ПустаяСтрока(КПП) Тогда
	//	ТекстСообщения = СтрШаблон("Получение информации о контрагенте, ИНН: %1", ИНН);
	//Иначе
	//	ТекстСообщения = СтрШаблон("Получение информации о контрагенте, ИНН/КПП: %1/%2", ИНН, КПП);
	//КонецЕсли;
	//ККСНГ_ЛогированиеКлиентСервер.ДобавитьИнформацию(Ответ.Журнал, ТекстСообщения);
	
	ЗапросAPI = ККСНГ_APIКурьер.v2_Client(ПараметрыАвторизации, ИНН, , КПП);
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросAPI.Журнал, Ложь);
	
	Если ЗапросAPI.Успех Тогда
		Ответ.Результат = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ЗапросAPI.Результат, "Company");
		Ответ.Успех = ЗапросAPI.Успех;
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

// Получает информацию о компании по ИНН и КПП
//
// Параметры:
//  ПараметрыАвторизации - Структура - Параметры авторизации в сервисе.
//						   Описание см. ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации
//  ИНН					 - 	Строка - ИНН контрагента
//  КПП					 - 	Строка - КПП контрагента
//
// Возвращаемое значение:
//  Ответ - Структура - Результат запроса
//
Функция ПолучитьИнформациюОКонтрагентеИзКурьераDiscover(ПараметрыАвторизации, ИНН, КПП) Экспорт
	
	Перем Ответ, ТекстСообщения, ЗапросAPI;
	Перем ClientDiscovery, ArrayOfClientDiscovery, ClientRelation, ArrayOfClientRelation;
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	
	//Если ПустаяСтрока(КПП) Тогда
	//	ТекстСообщения = СтрШаблон("Получение информации о контрагенте, ИНН: %1", ИНН);
	//Иначе
	//	ТекстСообщения = СтрШаблон("Получение информации о контрагенте, ИНН/КПП: %1/%2", ИНН, КПП);
	//КонецЕсли;
	//ККСНГ_ЛогированиеКлиентСервер.ДобавитьИнформацию(Ответ.Журнал, ТекстСообщения);
	
	ClientDiscovery = Новый Структура;
	ClientDiscovery.Вставить("Inn", ИНН);
	ClientDiscovery.Вставить("Kpp", КПП);
	
	ArrayOfClientDiscovery = Новый Массив;
	ArrayOfClientDiscovery.Добавить(ClientDiscovery);
	
	ClientDiscovery = Новый Структура("ClientDiscovery", ArrayOfClientDiscovery);
	
	ЗапросAPI = ККСНГ_APIКурьер.v2_ClientDiscover(ПараметрыАвторизации, ClientDiscovery);
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросAPI.Журнал, Ложь);
	
	Если ЗапросAPI.Успех Тогда
		
		ArrayOfClientRelation = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ЗапросAPI.Результат, "ClientRelation");
		Если ТипЗнч(ArrayOfClientRelation) = Тип("Массив") И ArrayOfClientRelation.Количество() > 0 Тогда
			
			Ответ.Результат = Новый Массив;
			
			Для каждого ClientRelation Из ArrayOfClientRelation Цикл
				Если СтрСравнить(ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ClientRelation, "Status"), "Exists") = 0 Тогда
					Ответ.Результат.Добавить(ClientRelation);
					Ответ.Успех = Истина;
				КонецЕсли;
			КонецЦикла
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

Функция ЗаписатьКонтрагентаЭДО(ПрофильЭДООрганизации, Контрагент, КодУчастникаЭДО, ИдентификаторСК) Экспорт
	
	Перем Ответ, ТекстСообщения, ОписаниеОшибки;
	Перем БлокировкаДанных, ЭлементБлокировки;
	Перем КонтрагентЭДОСсылка, КонтрагентЭДООбъект;
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	
	ТекстСообщения = СтрШаблон("Запись контрагента ЭДО: %1", Контрагент);
	ТекстКомментария = СтрШаблон("Код ЭДО '%1', идентификатор '%2'", КодУчастникаЭДО, XMLСтрока(ИдентификаторСК));
	ККСНГ_ЛогированиеКлиентСервер.ДобавитьИнформацию(Ответ.Журнал, ТекстСообщения, ТекстКомментария, Контрагент);
	
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	
	Попытка
		
		БлокировкаДанных = Новый БлокировкаДанных();
		
		ЭлементБлокировки = БлокировкаДанных.Добавить("Справочник.ККСНГ_Контрагенты");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("Владелец", ПрофильЭДООрганизации);
		ЭлементБлокировки.УстановитьЗначение("Контрагент", Контрагент);
		БлокировкаДанных.Заблокировать();
		
		КонтрагентЭДОСсылка = Справочники.ККСНГ_Контрагенты.НайтиПоРеквизиту("Контрагент", Контрагент, , ПрофильЭДООрганизации); 
		
		Если ЗначениеЗаполнено(КонтрагентЭДОСсылка) Тогда
			КонтрагентЭДООбъект = КонтрагентЭДОСсылка.ПолучитьОбъект();
		Иначе
			КонтрагентЭДООбъект = Справочники.ККСНГ_Контрагенты.СоздатьЭлемент();
		КонецЕсли;
		
		КонтрагентЭДООбъект.Владелец = ПрофильЭДООрганизации;
		КонтрагентЭДООбъект.Контрагент = Контрагент;
		КонтрагентЭДООбъект.КодУчастникаЭДО = КодУчастникаЭДО;
		КонтрагентЭДООбъект.ИдентификаторСК = ИдентификаторСК;
		КонтрагентЭДООбъект.Записать();
		
		ЗафиксироватьТранзакцию();
		
		Ответ.Результат = КонтрагентЭДООбъект.Ссылка;
		Ответ.Успех = Истина;
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ОписаниеОшибки = ОписаниеОшибки();
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, "Не удалось записать контрагента ЭДО", "RI-00102", ОписаниеОшибки, Контрагент);
		
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьНовуюТаблицуПриглашений()
	
	КС = Новый КвалификаторыСтроки(255);
	КЧ = Новый КвалификаторыЧисла(10);
	Массив = Новый Массив;
	Массив.Добавить(Тип("Строка"));
	ОписаниеТиповС = Новый ОписаниеТипов(Массив,, КС);
	Массив.Очистить();
	Массив.Добавить(Тип("Число"));
	ОписаниеТиповЧ = Новый ОписаниеТипов(Массив,,, КЧ);
	Массив.Очистить();
	Массив.Добавить(Тип("Дата"));
	ОписаниеТиповД = Новый ОписаниеТипов(Массив);
	Массив.Очистить();
	Массив.Добавить(Тип("Булево"));
	ОписаниеТиповБ = Новый ОписаниеТипов(Массив);
	
	ТаблицаПриглашений = Новый ТаблицаЗначений;
	ТаблицаПриглашений.Колонки.Добавить("Id", ОписаниеТиповЧ);
	ТаблицаПриглашений.Колонки.Добавить("IsLocal", ОписаниеТиповБ);
	ТаблицаПриглашений.Колонки.Добавить("SenderName", ОписаниеТиповС);
	ТаблицаПриглашений.Колонки.Добавить("SenderKpp", ОписаниеТиповС);
	ТаблицаПриглашений.Колонки.Добавить("SenderInn", ОписаниеТиповС);
	ТаблицаПриглашений.Колонки.Добавить("Side", ОписаниеТиповС);
	ТаблицаПриглашений.Колонки.Добавить("Status", ОписаниеТиповС);
	ТаблицаПриглашений.Колонки.Добавить("StatusName", ОписаниеТиповС);
	ТаблицаПриглашений.Колонки.Добавить("Date", ОписаниеТиповД);
	ТаблицаПриглашений.Колонки.Добавить("AcceptionDate", ОписаниеТиповД);
	ТаблицаПриглашений.Колонки.Добавить("UserId", ОписаниеТиповЧ);
	ТаблицаПриглашений.Колонки.Добавить("UserName", ОписаниеТиповС);
	ТаблицаПриглашений.Колонки.Добавить("Login", ОписаниеТиповС);
	ТаблицаПриглашений.Колонки.Добавить("AbonentCode", ОписаниеТиповС);
	ТаблицаПриглашений.Колонки.Добавить("ReceiverId", ОписаниеТиповЧ);
	ТаблицаПриглашений.Колонки.Добавить("ReceiverName", ОписаниеТиповС);
	ТаблицаПриглашений.Колонки.Добавить("ReceiverKpp", ОписаниеТиповС);
	ТаблицаПриглашений.Колонки.Добавить("ReceiverInn", ОписаниеТиповС);
	ТаблицаПриглашений.Колонки.Добавить("Contacts", ОписаниеТиповС);
	ТаблицаПриглашений.Колонки.Добавить("Email", ОписаниеТиповС);
	Возврат ТаблицаПриглашений;
	
КонецФункции

Процедура СообщитьСтатусВыполненияЗадания(Описание, КоличествоОбработанных = 0, ОбщееКоличество = 100, АдресВременногоХранилища = "")
	
	Перем СтатусВыполнения, СообщениеПользователю;
	
	СтатусВыполнения = Новый Структура;
	СтатусВыполнения.Вставить("Описание", Описание);
	СтатусВыполнения.Вставить("КоличествоОбработанных", КоличествоОбработанных);
	СтатусВыполнения.Вставить("ОбщееКоличество", ОбщееКоличество);
	Если ЭтоАдресВременногоХранилища(АдресВременногоХранилища) Тогда
		СтатусВыполнения.Вставить("АдресВременногоХранилища", АдресВременногоХранилища);
	КонецЕсли;
	
	СообщениеПользователю = Новый СообщениеПользователю;
	СообщениеПользователю.Текст = ЗначениеВСтрокуВнутр(СтатусВыполнения);
	СообщениеПользователю.Сообщить();
	
КонецПроцедуры

#КонецОбласти
